// 문자열을 정수로 바꾸기

/* 
< 문제설명 >
- 문자열 s를 숫자로 변환한 결과를 반환하는 함수, solution을 완성하세요.

- 제한사항
  - s의 길이는 1 이상 5이하입니다.
  - s의 맨앞에는 부호(+, -)가 올 수 있습니다.
  - s는 부호와 숫자로만 이루어져있습니다.
  - s는 "0"으로 시작하지 않습니다. */

  function solution(s) {
    let str = parseInt(s);
    return str;
}



  // --------------------------------------------------------------
  
  
  
  // 정수 내림차순으로 배치하기
  
  /* 
  < 문제설명 >
  - 함수 solution은 정수 n을 매개변수로 입력받습니다.
    n의 각 자릿수를 큰것부터 작은 순으로 정렬한 새로운 정수를 리턴해주세요.
    예를들어 n이 118372면 873211을 리턴하면 됩니다.
  
  - 제한사항
  - n은 1이상 8000000000 이하인 자연수입니다. */
  
// 어려워 ! 모르겠어 !!